/**
 * Сформувати файл loop.js, у якому створити по одному циклу проходу від 0 до 9,
 * на кожній ітерації якого виводитиметься значення поточного ітератора.
 * Потім по одному циклу від 100 до 0 з кроком 10, де виводитиметься ітератор на кожній ітерації.
 */

// 1. Цикл for для виведення чисел від 0 до 9
console.log("1. Цикл for від 0 до 9");
for (let i = 0; i < 10; i++) {
    console.log(`Ітерація ${i+1}, поточне значення ${i}`);
}

// 2. Цикл while для виведення чисел від 100 до 0 з кроком 10
console.log("\n2. Цикл while від 100 до 0 з кроком 10:");
let counter = 100;
let iterator = 1;
while (counter >= 0) {
    console.log(`Ітерація: ${iterator}, значення: ${counter}`);
    counter -= 10;
    iterator++;
}
